### Terraform Plan Results

**Status:** ✅ Success

<details><summary>Show Plan</summary>

```terraform
local_file.web_app_wrangler_production[0]: Refreshing state... [id=385ba23f828f0652d32cb2612b6fec0c46009699]
data.external.modal_source_hash: Reading...
null_resource.github_bot_build[0]: Refreshing state... [id=848263258635147423]
null_resource.teams_bot_build[0]: Refreshing state... [id=2345863727674391649]
module.modal_app.null_resource.modal_volume[0]: Refreshing state... [id=5644798168022997553]
null_resource.linear_bot_build[0]: Refreshing state... [id=4222913033287519466]
module.teams_kv[0].cloudflare_workers_kv_namespace.this: Refreshing state... [id=d99e8896d17b405ebbcbc6fd48c97fb8]
module.linear_kv[0].cloudflare_workers_kv_namespace.this: Refreshing state... [id=6d730ef2f0e34d0db2ce6e38833a53f9]
cloudflare_d1_database.main: Refreshing state... [id=f55dda63-da5a-4103-a56d-ed1c088d4bdc]
module.session_index_kv.cloudflare_workers_kv_namespace.this: Refreshing state... [id=af130657ae9e45b59a91c40cb362fb3d]
null_resource.control_plane_build: Refreshing state... [id=7485223517067938545]
null_resource.web_app_cloudflare_build[0]: Refreshing state... [id=5437874766786392811]
module.modal_app.null_resource.modal_secrets[0]: Refreshing state... [id=5204225899843989258]
data.external.modal_source_hash: Read complete after 0s [id=-]
module.modal_app.null_resource.modal_deploy: Refreshing state... [id=8092582219858226]
module.teams_bot_worker[0].cloudflare_worker.this: Refreshing state... [id=ffdf395538bc42acbfde3079f156920b]
module.linear_bot_worker[0].cloudflare_worker.this: Refreshing state... [id=2c272f12d2c7418f883e0995880f2939]
null_resource.d1_migrations: Refreshing state... [id=1196225176564041792]
module.teams_bot_worker[0].cloudflare_worker_version.this: Refreshing state... [id=b548518c-698c-44db-a202-bea8bb0128c0]
module.linear_bot_worker[0].cloudflare_worker_version.this: Refreshing state... [id=402328a9-18b5-4214-86ce-39201a4035b5]
module.teams_bot_worker[0].cloudflare_workers_deployment.this: Refreshing state... [id=fbdeb361-2c75-4e9b-af56-9172490f9947]
module.linear_bot_worker[0].cloudflare_workers_deployment.this: Refreshing state... [id=9fafe7df-7849-475c-9bee-806e8170d8c9]
module.control_plane_worker.cloudflare_worker.this: Refreshing state... [id=bf88879cbd93491ebae373f07687249e]
module.control_plane_worker.cloudflare_worker_version.this: Refreshing state... [id=2e02f662-b49e-4099-b9f8-7a03efd84a0c]
module.control_plane_worker.cloudflare_workers_deployment.this: Refreshing state... [id=f93692c1-bdfd-4f37-9546-fc36628121df]
null_resource.web_app_cloudflare_deploy[0]: Refreshing state... [id=7879902477467934968]
module.github_bot_worker[0].cloudflare_worker.this: Refreshing state... [id=70cca814a115489c9546f56362d2d84a]
null_resource.web_app_cloudflare_secrets[0]: Refreshing state... [id=6050167598202515541]
module.github_bot_worker[0].cloudflare_worker_version.this: Refreshing state... [id=3faca78c-0c93-412d-9f82-50aa8eaac99a]
module.github_bot_worker[0].cloudflare_workers_deployment.this: Refreshing state... [id=9c6f656f-787f-4e6b-bb66-bf9044266ef9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.web_app_wrangler_production[0] will be created
  + resource "local_file" "web_app_wrangler_production" {
      + content              = <<-EOT
            name = "open-inspect-web-colleqtive"
            main = ".open-next/worker.js"
            compatibility_date = "2025-08-15"
            compatibility_flags = ["nodejs_compat", "global_fetch_strictly_public"]
            
            [vars]
            GITHUB_CLIENT_ID = "Iv23livHLxZ9Ei4Ppgtt"
            NEXTAUTH_URL = "https://open-inspect-web-colleqtive.cllqtv.workers.dev"
            CONTROL_PLANE_URL = "https://open-inspect-control-plane-colleqtive.cllqtv.workers.dev"
            NEXT_PUBLIC_WS_URL = "wss://open-inspect-control-plane-colleqtive.cllqtv.workers.dev"
            ALLOWED_USERS = ""
            ALLOWED_EMAIL_DOMAINS = ""
            
            [assets]
            directory = ".open-next/assets"
            binding = "ASSETS"
            
            [[services]]
            binding = "CONTROL_PLANE_WORKER"
            service = "open-inspect-control-plane-colleqtive"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../..//packages/web/wrangler.production.toml"
      + id                   = (known after apply)
    }

  # null_resource.control_plane_build must be replaced
-/+ resource "null_resource" "control_plane_build" {
      ~ id       = "7485223517067938545" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-03T16:35:40Z" -> (known after apply)
        }
    }

  # null_resource.github_bot_build[0] must be replaced
-/+ resource "null_resource" "github_bot_build" {
      ~ id       = "848263258635147423" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-03T16:35:39Z" -> (known after apply)
        }
    }

  # null_resource.linear_bot_build[0] must be replaced
-/+ resource "null_resource" "linear_bot_build" {
      ~ id       = "4222913033287519466" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-03T16:35:40Z" -> (known after apply)
        }
    }

  # null_resource.teams_bot_build[0] must be replaced
-/+ resource "null_resource" "teams_bot_build" {
      ~ id       = "2345863727674391649" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-03T16:35:40Z" -> (known after apply)
        }
    }

  # null_resource.web_app_cloudflare_build[0] must be replaced
-/+ resource "null_resource" "web_app_cloudflare_build" {
      ~ id       = "5437874766786392811" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-03T16:35:39Z" -> (known after apply)
        }
    }

  # null_resource.web_app_cloudflare_deploy[0] must be replaced
-/+ resource "null_resource" "web_app_cloudflare_deploy" {
      ~ id       = "7879902477467934968" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-03T16:36:05Z" -> (known after apply)
        }
    }

  # module.control_plane_worker.cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-03-03T16:35:49Z" -> (known after apply)
      ~ id                  = "2e02f662-b49e-4099-b9f8-7a03efd84a0c" -> (known after apply)
      + limits              = (known after apply)
      ~ number              = 33 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.control_plane_worker.cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "dev@colleqtive.com" -> (known after apply)
      ~ created_on   = "2026-03-03T16:35:50Z" -> (known after apply)
      ~ id           = "f93692c1-bdfd-4f37-9546-fc36628121df" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "2e02f662-b49e-4099-b9f8-7a03efd84a0c" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.github_bot_worker[0].cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-03-03T16:35:57Z" -> (known after apply)
      ~ id                  = "3faca78c-0c93-412d-9f82-50aa8eaac99a" -> (known after apply)
      + limits              = (known after apply)
      ~ modules             = [
          - { # forces replacement
              - content_file   = "../../..//packages/github-bot/dist/index.js" -> null
              - content_sha256 = "db4896184001a6f2cd97e2526c58443ad45651f53b761373cf5ba84b71182618" -> null
              - content_type   = "application/javascript+module" -> null
              - name           = "index.js" -> null
            },
          + { # forces replacement
              + content_file   = "../../..//packages/github-bot/dist/index.js"
              + content_sha256 = "86d98ea60048b73d0ecf59a25fed4d7c09080cd30e96cdc80bead35d7168acca"
              + content_type   = "application/javascript+module"
              + name           = "index.js"
            },
        ]
      ~ number              = 27 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 0 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.github_bot_worker[0].cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "dev@colleqtive.com" -> (known after apply)
      ~ created_on   = "2026-03-03T16:36:04Z" -> (known after apply)
      ~ id           = "9c6f656f-787f-4e6b-bb66-bf9044266ef9" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "3faca78c-0c93-412d-9f82-50aa8eaac99a" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.linear_bot_worker[0].cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-03-03T16:35:45Z" -> (known after apply)
      ~ id                  = "402328a9-18b5-4214-86ce-39201a4035b5" -> (known after apply)
      + limits              = (known after apply)
      ~ number              = 7 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.linear_bot_worker[0].cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "dev@colleqtive.com" -> (known after apply)
      ~ created_on   = "2026-03-03T16:35:46Z" -> (known after apply)
      ~ id           = "9fafe7df-7849-475c-9bee-806e8170d8c9" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "402328a9-18b5-4214-86ce-39201a4035b5" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.teams_bot_worker[0].cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-03-03T16:35:44Z" -> (known after apply)
      ~ id                  = "b548518c-698c-44db-a202-bea8bb0128c0" -> (known after apply)
      + limits              = (known after apply)
      ~ number              = 22 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.teams_bot_worker[0].cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "dev@colleqtive.com" -> (known after apply)
      ~ created_on   = "2026-03-03T16:35:46Z" -> (known after apply)
      ~ id           = "fbdeb361-2c75-4e9b-af56-9172490f9947" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "b548518c-698c-44db-a202-bea8bb0128c0" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 15 to add, 0 to change, 14 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

*Pushed by: @jmunckhof*